package lesson1;/*
Задача 2
    Вывести ваше имя посимвольно, где каждая буква — на новой строке, не используя System.out.println().
    С использованием Char: вывести свое имя в консоль.
 */


public class Task2v5 {
    public static void main(String[] args) {

        char st0 = 'М'; //обьявляем переменную
        System.out.print(st0); //выводим переменную
        System.out.print('\n'); //перенос строки    

        char st1 = 'а'; //обьявляем переменную
        System.out.print(st1); //выводим переменную
        System.out.print('\n'); //перенос строки 

        char st2 = 'к'; //обьявляем переменную
        System.out.print(st2); //выводим переменную
        System.out.print('\n'); //перенос строки 

        char st3 = 'с'; //обьявляем переменную
        System.out.print(st3); //выводим переменную
        System.out.print('\n'); //перенос строки 

        char st4 = 'и'; //обьявляем переменную
        System.out.print(st4); //выводим переменную
        System.out.print('\n'); //перенос строки 

        char st5= 'м'; //обьявляем переменную
        System.out.print(st5); //выводим переменную

    }
}