package lesson1;/*
Задача 2
    Вывести ваше имя посимвольно, где каждая буква — на новой строке, не используя System.out.println().
    С использованием одного Char: вывести свое имя в консоль.
 */


public class Task2v4 {
    public static void main(String[] args) {

        char st0 = 'М'; //обьявляем переменную
        System.out.print(st0); //выводим переменную
        System.out.print('\n'); //перенос строки

        st0 = 'а'; //обьявляем переменную
        System.out.print(st0); //выводим переменную
        System.out.print('\n'); //перенос строки

        st0 = 'к'; //обьявляем переменную
        System.out.print(st0); //выводим переменную
        System.out.print('\n'); //перенос строки

        st0 = 'с'; //обьявляем переменную
        System.out.print(st0); //выводим переменную
        System.out.print('\n'); //перенос строки

        st0 = 'и'; //обьявляем переменную
        System.out.print(st0); //выводим переменную
        System.out.print('\n'); //перенос строки

        st0 = 'м'; //обьявляем переменную
        System.out.print(st0); //выводим переменную

    }
}